# Задание 1
user_last_name = input('Введите фамилию ')
user_first_name = input('Введите имя ')
user_middle_name = input('Введите отчество ')
print(user_last_name, user_first_name[0] + '.' + user_middle_name[0] + '.')

