# Задание 1
user_last_name = input('Введите фамилию ') #Ввод фамилии
user_first_name = input('Введите имя ')#Ввод имени
user_middle_name = input('Введите отчество ') #Ввод отчества
print(user_last_name, user_first_name[0] + '.' + user_middle_name[0] + '.') #Вывод в формате Фамилия И.О.